pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
/**
 * @file file_browser.cpp
 * @brief File Browser Component Implementation
 */

#include "file_browser.h"

#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "../styles/ui_theme.h"
#include "comm/i_comm_interface.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "inter_mcu.h"
#include "lvgl.h"
#include "spi_protocol/protocol.h"

#include <cstdio>
// Mark UI content changes so the main UI task triggers a refresh
#ifndef WAVEX_TEST_BUILD
#include "ui_task.h"
#else
#include "../../../tests/mocks/esp32_mocks.h"
#endif

using namespace WaveX::Protocol;

// LVGL includes for thread safety
#include "esp_lvgl_port.h"

// NOTE: LVGL locks are handled by UI task loop - all UI updates use deferred update pattern

static const char* TAG = "FILE_BROWSER";

// ---------------------------------------------------------------------------
// Row rendering (design 1b)
// ---------------------------------------------------------------------------
// One place, called from all three row-building sites. They had drifted:
// different fonts, different selection colours, and the duration was not shown
// at all. A row is 54px, directories read dim, and the duration sits right.

#define FB_ROW_H 54
#define FB_COL_LIST_BG lv_color_hex(0x0E0E0E)
#define FB_COL_SEL_BG lv_color_hex(0x14261A)
#define FB_COL_SEL_RING lv_color_hex(0x4CAF50)
#define FB_COL_BORDER lv_color_hex(0x222222)
#define FB_COL_DIM lv_color_hex(0x8FA0AA)
#define FB_COL_META lv_color_hex(0x7F8A90)

static void fb_format_duration(char* out, size_t n, uint32_t ms) {
    if (ms == 0) {
        out[0] = '\0';
        return;
    }
    const uint32_t total_s = ms / 1000;
    snprintf(out, n, "%lu:%02lu", (unsigned long)(total_s / 60), (unsigned long)(total_s % 60));
}

// Applies the row chrome and adds the right-aligned duration. `entry` may be
// null for placeholder rows ("No files found...").
static void fb_style_row(lv_obj_t* btn, const wavex_file_entry_t* entry, bool selected) {
    if (!btn) {
        return;
    }
    lv_obj_set_height(btn, FB_ROW_H);
    lv_obj_set_style_radius(btn, 4, LV_PART_MAIN);
    lv_obj_set_style_pad_left(btn, 14, LV_PART_MAIN);
    lv_obj_set_style_pad_right(btn, 16, LV_PART_MAIN);
    lv_obj_set_style_bg_color(btn, selected ? FB_COL_SEL_BG : FB_COL_LIST_BG, LV_PART_MAIN);
    lv_obj_set_style_border_color(btn, selected ? FB_COL_SEL_RING : FB_COL_BORDER, LV_PART_MAIN);
    lv_obj_set_style_border_width(btn, selected ? 2 : 1, LV_PART_MAIN);

    lv_obj_t* name_label = lv_obj_get_child(btn, 0);
    if (name_label) {
        lv_obj_set_style_text_font(name_label, &lv_font_montserrat_22, LV_PART_MAIN);
        // Directories read dim: they are navigation, not material.
        const bool dir = entry && entry->is_directory;
        lv_obj_set_style_text_color(name_label, dir ? FB_COL_DIM : UI_COLOR_TEXT, LV_PART_MAIN);
    }

    if (!entry || entry->is_directory || entry->duration_ms == 0) {
        return;
    }
    char dur[16];
    fb_format_duration(dur, sizeof(dur), entry->duration_ms);
    if (dur[0] == '\0') {
        return;
    }
    // One duration label per row, reused rather than appended - this styler
    // runs again on every selection change.
    lv_obj_t* meta = (lv_obj_get_child_cnt(btn) > 1) ? lv_obj_get_child(btn, 1) : nullptr;
    if (!meta) {
        meta = lv_label_create(btn);
        lv_obj_set_style_text_font(meta, &lv_font_montserrat_18, LV_PART_MAIN);
        lv_obj_set_style_text_color(meta, FB_COL_META, LV_PART_MAIN);
    }
    lv_label_set_text(meta, dur);
    lv_obj_align(meta, LV_ALIGN_RIGHT_MID, 0, 0);
}

// Browser instances are passed via user_data in callbacks - no global needed

// Forward declarations
static void file_list_event_cb(lv_event_t* e);
static bool refresh_file_list(wavex_file_browser_t* browser);
static bool parse_browse_response(const uint8_t* data,
                                  size_t length,
                                  wavex_file_entry_t* entries,
                                  uint32_t* count);
static bool parse_browse_response_with_pagination(const uint8_t* data,
                                                  size_t length,
                                                  wavex_file_entry_t* entries,
                                                  uint32_t* count,
                                                  uint32_t* total_files,
                                                  uint8_t* current_page_entries,
                                                  const char* current_path);
static bool send_browse_request(WaveX::Comm::ICommInterface* comm_interface,
                                const char* path,
                                uint8_t start_index = 0);
static void update_visual_selection(wavex_file_browser_t* browser);
static void browse_resp_callback(const uint8_t* data, size_t length, void* user_data);
static void storage_status_callback(bool mounted, void* user_data);
static void update_file_browser_ui(wavex_file_browser_t* browser);

// Cross-task handoff for ui_update_pending (dma-timing-review-2026-07-03.md
// Finding 11): browse_resp_callback runs on the UART task, writing
// browser->entries[] and then setting this flag, while the UI task reads
// the flag and then the entries. On the dual-core P4 a plain bool store
// guarantees no ordering between those writes - the UI task could see the
// flag set but the entries only partially written. The release-store /
// acquire-load pair below provides that ordering; all other stores go
// through the same helpers so no plain access ever races an atomic one on
// the same address.
static inline void browser_set_ui_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->ui_update_pending, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_ui_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->ui_update_pending, false, __ATOMIC_RELAXED);
}
static inline bool browser_ui_update_pending(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->ui_update_pending, __ATOMIC_ACQUIRE);
}

// Cheap sibling of the flag above for selection moves that leave the viewport
// where it is: the UI task only restyles the highlight instead of destroying
// and recreating every visible LVGL button. Same release/acquire discipline -
// selection can move from the UI task (encoder) and the LVGL task (softkeys).
static inline void browser_set_selection_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->selection_update_pending, true, __ATOMIC_RELEASE);
}
static inline void browser_clear_selection_update(wavex_file_browser_t* browser) {
    __atomic_store_n(&browser->selection_update_pending, false, __ATOMIC_RELAXED);
}
static inline bool browser_selection_update_pending(const wavex_file_browser_t* browser) {
    return __atomic_load_n(&browser->selection_update_pending, __ATOMIC_ACQUIRE);
}

