pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
wavex_file_browser_t* wavex_file_browser_create(lv_obj_t* parent,
                                                const wavex_file_browser_config_t* config) {
    if (!parent || !config) {
        ESP_LOGE(TAG, "Invalid parameters");
        return NULL;
    }

    wavex_file_browser_t* browser = (wavex_file_browser_t*)malloc(sizeof(wavex_file_browser_t));
    if (!browser) {
        ESP_LOGE(TAG, "Failed to allocate file browser structure");
        return NULL;
    }

    // Initialize structure
    memset(browser, 0, sizeof(wavex_file_browser_t));
    browser->config = *config;
    browser->selected_index = 0;
    browser->first_visible_index = 0;
    browser->visible_count =
        8;  // Approximately 8 entries visible on screen (adjust based on screen size)

    // Initialize pagination state
    browser->total_files = 0;
    browser->current_page = 0;
    browser->entries_per_page =
        20;  // Daisy now sends 20 entries per page with flexible packet system
    browser->pagination_in_progress = false;
    browser->loaded_entries = 0;

    // Copy root path
    strncpy(browser->current_path,
            config->root_path ? config->root_path : "/",
            sizeof(browser->current_path) - 1);
    browser->current_path[sizeof(browser->current_path) - 1] = '\0';

    // Allocate entries array
    browser->entries =
        (wavex_file_entry_t*)malloc(config->max_entries * sizeof(wavex_file_entry_t));
    if (!browser->entries) {
        ESP_LOGE(TAG, "Failed to allocate entries array");
        free(browser);
        return NULL;
    }

    // Create main container (page creation callbacks already have LVGL context)
    browser->container = lv_obj_create(parent);
    lv_obj_set_size(browser->container, lv_pct(100), lv_pct(100));
    lv_obj_set_style_bg_color(browser->container, UI_COLOR_CONTENT, LV_PART_MAIN);
    lv_obj_set_style_border_width(browser->container, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(browser->container, 0, LV_PART_MAIN);
    lv_obj_align(browser->container, LV_ALIGN_TOP_LEFT, 0, 0);

    // Create path label
    browser->path_label = lv_label_create(browser->container);
    lv_label_set_text(browser->path_label, browser->current_path);
    ui_theme_apply_label_style(browser->path_label, false);
    lv_obj_align(browser->path_label, LV_ALIGN_TOP_LEFT, UI_PADDING_MEDIUM, UI_PADDING_MEDIUM);

    // Create file list
    browser->list = lv_list_create(browser->container);
    // Note: Do not perform arithmetic with lv_pct(); set full height and offset below path label
    lv_obj_set_size(browser->list, lv_pct(100), lv_pct(100));
    lv_obj_align(
        browser->list, LV_ALIGN_TOP_LEFT, 0, 40);  // visually below the 40px-tall path label
    lv_obj_set_style_bg_color(browser->list, UI_COLOR_CONTENT, LV_PART_MAIN);
    lv_obj_set_style_border_width(browser->list, 0, LV_PART_MAIN);
    lv_obj_set_style_pad_all(browser->list, UI_PADDING_SMALL, LV_PART_MAIN);

    // Add event callback for list
    lv_obj_add_event_cb(browser->list, file_list_event_cb, LV_EVENT_CLICKED, browser);

    // Register browse response callback with comm interface
    if (config->comm_interface) {
        config->comm_interface->setBrowseResponseListener(browse_resp_callback, browser);
        // Re-list automatically when a card appears. The backend owns the card
        // slot; without this the browser only refreshes when the user leaves
        // the page and comes back.
        config->comm_interface->setStorageStatusListener(storage_status_callback, browser);
    } else {
        ESP_LOGE(TAG, "No comm interface provided to file browser");
        return NULL;
    }

    // Refresh file list
    ESP_LOGI(TAG, "Calling refresh_file_list for path: %s", browser->current_path);
    if (!refresh_file_list(browser)) {
        ESP_LOGE(TAG, "Failed to refresh file list");
    }

    // Log all file entries for debugging
    for (uint32_t i = 0; i < browser->entry_count; i++) {
        ESP_LOGI(TAG,
                 "Entry %d: %s (%s) - %s",
                 i,
                 browser->entries[i].name,
                 browser->entries[i].is_directory ? "DIR" : "FILE",
                 browser->entries[i].path);
    }
    return browser;
}

void wavex_file_browser_destroy(wavex_file_browser_t* browser) {
    if (!browser)
        return;

    // Browser cleanup handled via user_data parameter in callbacks

    if (browser->entries) {
        free(browser->entries);
    }

    if (browser->container) {
        // Page destruction should be called from LVGL context
        lv_obj_del(browser->container);
    }

    free(browser);
    ESP_LOGI(TAG, "File browser destroyed");
}

bool wavex_file_browser_navigate_to(wavex_file_browser_t* browser, const char* path) {
    if (!browser || !path)
        return false;

    strncpy(browser->current_path, path, sizeof(browser->current_path) - 1);
    browser->current_path[sizeof(browser->current_path) - 1] = '\0';

    // Mark path update as pending (navigation may be called from non-LVGL context)
    browser_set_ui_update(browser);
    wavex_ui_mark_content_changed();

    // Reset scroll position and selection when navigating
    browser->first_visible_index = 0;
    browser->selected_index = 0;

    // Refresh file list
    bool success = refresh_file_list(browser);

    // Notify directory changed callback
    if (success && browser->dir_changed_cb) {
        browser->dir_changed_cb(browser->current_path, browser->user_data);
    }

    return success;
}

bool wavex_file_browser_navigate_up(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    // Check if we're already at root directory
    if (strcmp(browser->current_path, "/") == 0) {
        ESP_LOGI(TAG, "Already at root directory, cannot navigate up");
        return false;
    }

    // Construct parent path without modifying current_path
    char parent_path[96];
    strncpy(parent_path, browser->current_path, sizeof(parent_path) - 1);
    parent_path[sizeof(parent_path) - 1] = '\0';

    // Find last directory separator
    char* last_slash = strrchr(parent_path, '/');
    if (last_slash && last_slash != parent_path) {
        *last_slash = '\0';
    } else {
        strcpy(parent_path, "/");
    }

    ESP_LOGI(TAG, "Navigating up: '%s' -> '%s'", browser->current_path, parent_path);

    return wavex_file_browser_navigate_to(browser, parent_path);
}

bool wavex_file_browser_refresh(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    return refresh_file_list(browser);
}

void wavex_file_browser_set_selection(wavex_file_browser_t* browser, uint32_t index) {
    if (!browser || index >= browser->entry_count)
        return;

    browser->selected_index = index;

    // Update viewport to ensure selected entry is visible
    uint32_t prev_first_visible = browser->first_visible_index;
    if (browser->selected_index < browser->first_visible_index) {
        browser->first_visible_index = browser->selected_index;
    } else {
        uint32_t last_visible_index = browser->first_visible_index + browser->visible_count - 1;
        if (browser->selected_index > last_visible_index) {
            browser->first_visible_index = browser->selected_index - (browser->visible_count - 1);
            if (browser->first_visible_index > browser->selected_index) {
                browser->first_visible_index = 0;
            }
        }
    }

    ESP_LOGD(TAG, "Selected entry %d: %s", index, browser->entries[index].name);

    // Mark the update as pending (selection may be changed from non-LVGL
    // context): full rebuild if the viewport scrolled, highlight-only if not.
    if (browser->first_visible_index != prev_first_visible) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();
}

const wavex_file_entry_t* wavex_file_browser_get_selected(wavex_file_browser_t* browser) {
    if (!browser || browser->selected_index >= browser->entry_count)
        return NULL;

    return &browser->entries[browser->selected_index];
}

uint32_t wavex_file_browser_get_selected_index(wavex_file_browser_t* browser) {
    if (!browser)
        return 0;

    return browser->selected_index;
}

// Navigate selection up with boundary checking and scrolling
bool wavex_file_browser_navigate_up_entry(wavex_file_browser_t* browser) {
    if (!browser || browser->entry_count == 0) {
        ESP_LOGD(TAG, "navigate_up: Invalid browser or no entries");
        return false;
    }

    // If already at first entry, do nothing (no wrap-around)
    if (browser->selected_index == 0) {
        ESP_LOGD(TAG, "navigate_up: Already at first entry (index 0)");
        return false;
    }

    uint32_t new_index = browser->selected_index - 1;
    browser->selected_index = new_index;
    ESP_LOGD(TAG, "navigate_up: moved from %u to %u", browser->selected_index + 1, new_index);

