pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    // Update viewport if selection moved above visible area
    bool viewport_moved = false;
    if (browser->selected_index < browser->first_visible_index) {
        browser->first_visible_index = browser->selected_index;
        viewport_moved = true;
        ESP_LOGD(TAG, "navigate_up: scrolled viewport to %u", browser->first_visible_index);
    }

    // Notify callback about selection change
    if (browser->file_selected_index_cb && browser->entries) {
        browser->file_selected_index_cb(browser->selected_index,
                                        &browser->entries[browser->selected_index],
                                        browser->user_data);
    }

    // Full rebuild only when the viewport scrolled; otherwise just move the
    // highlight.
    if (viewport_moved) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();

    return true;
}

// Navigate selection down with boundary checking and scrolling
bool wavex_file_browser_navigate_down_entry(wavex_file_browser_t* browser) {
    if (!browser || browser->entry_count == 0) {
        ESP_LOGD(TAG, "navigate_down: Invalid browser or no entries");
        return false;
    }

    uint32_t last_index = browser->entry_count - 1;

    // If already at last entry, do nothing (no wrap-around)
    if (browser->selected_index >= last_index) {
        ESP_LOGD(TAG, "navigate_down: Already at last entry (index %u)", browser->selected_index);
        return false;
    }

    uint32_t new_index = browser->selected_index + 1;
    browser->selected_index = new_index;
    ESP_LOGD(TAG, "navigate_down: moved from %u to %u", browser->selected_index - 1, new_index);

    // Update viewport if selection moved below visible area
    bool viewport_moved = false;
    uint32_t last_visible_index = browser->first_visible_index + browser->visible_count - 1;
    if (browser->selected_index > last_visible_index) {
        // Scroll down to show the selected entry
        browser->first_visible_index = browser->selected_index - (browser->visible_count - 1);
        // Ensure first_visible_index doesn't go negative (unsigned will wrap, so check bounds)
        if (browser->first_visible_index > browser->selected_index) {
            browser->first_visible_index = 0;
        }
        viewport_moved = true;
        ESP_LOGD(TAG, "navigate_down: scrolled viewport to %u", browser->first_visible_index);
    }

    // Notify callback about selection change
    if (browser->file_selected_index_cb && browser->entries) {
        browser->file_selected_index_cb(browser->selected_index,
                                        &browser->entries[browser->selected_index],
                                        browser->user_data);
    }

    // Full rebuild only when the viewport scrolled; otherwise just move the
    // highlight.
    if (viewport_moved) {
        browser_set_ui_update(browser);
    } else {
        browser_set_selection_update(browser);
    }
    wavex_ui_mark_content_changed();

    return true;
}

void wavex_file_browser_set_file_selected_callback(wavex_file_browser_t* browser,
                                                   wavex_file_selected_cb_t callback,
                                                   void* user_data) {
    if (!browser)
        return;

    browser->file_selected_cb = callback;
    browser->user_data = user_data;
}

void wavex_file_browser_set_file_selected_index_callback(wavex_file_browser_t* browser,
                                                         wavex_file_selected_index_cb_t callback,
                                                         void* user_data) {
    if (!browser)
        return;

    browser->file_selected_index_cb = callback;
    browser->user_data = user_data;
}

void wavex_file_browser_set_directory_changed_callback(wavex_file_browser_t* browser,
                                                       wavex_directory_changed_cb_t callback,
                                                       void* user_data) {
    if (!browser)
        return;

    browser->dir_changed_cb = callback;
    browser->user_data = user_data;
}

const char* wavex_file_browser_get_current_path(wavex_file_browser_t* browser) {
    if (!browser)
        return NULL;

    return browser->current_path;
}

uint32_t wavex_file_browser_get_entry_count(wavex_file_browser_t* browser) {
    if (!browser)
        return 0;

    return browser->entry_count;
}

const wavex_file_entry_t* wavex_file_browser_get_entry(wavex_file_browser_t* browser,
                                                       uint32_t index) {
    if (!browser || index >= browser->entry_count)
        return NULL;

    return &browser->entries[index];
}

// File list event callback
static void file_list_event_cb(lv_event_t* e) {
    lv_event_code_t code = lv_event_get_code(e);
    wavex_file_browser_t* browser = (wavex_file_browser_t*)lv_event_get_user_data(e);

    if (code == LV_EVENT_CLICKED) {
        // lv_event_get_current_target returns the object the callback was attached to (the list)
        // lv_event_get_target returns the actual object that was clicked (the button)
        lv_obj_t* list = (lv_obj_t*)lv_event_get_current_target(e);
        lv_obj_t* btn = (lv_obj_t*)lv_event_get_target(e);

        // Find the button index by iterating through the list
        uint32_t ui_index = 0;
        lv_obj_t* child = lv_obj_get_child(list, 0);
        while (child && child != btn) {
            child = lv_obj_get_child(list, ui_index + 1);
            ui_index++;
        }

        // Handle ".." entries that come from Daisy
        uint32_t entry_index = ui_index;

        if (entry_index < browser->entry_count) {
            const wavex_file_entry_t* entry = &browser->entries[entry_index];
            if (strcmp(entry->name, "..") == 0) {
                // ".." entry clicked - navigate up
                ESP_LOGI(TAG, "Parent directory entry clicked");
                wavex_file_browser_navigate_up(browser);
                return;
            }
        }

        if (entry_index < browser->entry_count) {
            wavex_file_browser_set_selection(browser, entry_index);

            // If it's a directory, navigate into it
            if (browser->entries[entry_index].is_directory) {
                char new_path[256];
                // Avoid double slashes when constructing directory path
                if (strcmp(browser->current_path, "/") == 0) {
                    snprintf(new_path, sizeof(new_path), "/%s", browser->entries[entry_index].name);
                } else {
                    snprintf(new_path,
                             sizeof(new_path),
                             "%s/%s",
                             browser->current_path,
                             browser->entries[entry_index].name);
                }
                ESP_LOGD(TAG,
                         "Directory navigation: current='%s', name='%s' -> new_path='%s'",
                         browser->current_path,
                         browser->entries[entry_index].name,
                         new_path);
                wavex_file_browser_navigate_to(browser, new_path);
            } else {
                // File selected - notify callback with index
                ESP_LOGI(TAG,
                         "File selected: %s, index=%d",
                         browser->entries[entry_index].name,
                         entry_index);

                if (browser->file_selected_index_cb) {
                    browser->file_selected_index_cb(
                        entry_index, &browser->entries[entry_index], browser->user_data);
                } else {
                    ESP_LOGW(TAG, "No callback set for file selection");
                }
            }
        }
    }
}

// Refresh file list by requesting directory contents from Daisy
static bool refresh_file_list(wavex_file_browser_t* browser) {
    if (!browser)
        return false;

    ESP_LOGI(TAG, "refresh_file_list called for path: %s", browser->current_path);

