pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    // Reset pagination state
    browser->total_files = 0;
    browser->current_page = 0;
    browser->pagination_in_progress = true;
    browser->loaded_entries = 0;
    browser->entry_count = 0;

    // Mark UI update as pending (will clear list when processed in UI task)
    browser_set_ui_update(browser);
    wavex_ui_mark_content_changed();

    // Send first browse request (page 0)
    if (!send_browse_request(browser->config.comm_interface, browser->current_path, 0)) {
        ESP_LOGE(TAG, "Failed to send browse request");
        browser->pagination_in_progress = false;
        // Mark error state for deferred UI update
        browser->entry_count = 0;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return false;
    } else {
        ESP_LOGI(TAG, "Sent browse request for page 0, waiting for response...");
        return true;
    }
}

// Parse browse response from Daisy using payload format (not full packet)
static bool parse_browse_response(const uint8_t* data,
                                  size_t length,
                                  wavex_file_entry_t* entries,
                                  uint32_t* count) {
    if (!data || length < sizeof(BrowseRespHeader)) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: %d bytes (need at least %d)",
                 (int)length,
                 (int)sizeof(BrowseRespHeader));
        *count = 0;
        return false;
    }

    // Parse payload directly: BrowseRespHeader + FileEntryWire entries
    const BrowseRespHeader* browse_header = (const BrowseRespHeader*)data;
    uint32_t total_count = browse_header->total_count;
    uint8_t n_entries = browse_header->n;

    ESP_LOGI(TAG,
             "Browse response: total_count=%lu, n_entries=%u",
             (unsigned long)total_count,
             n_entries);

    // Debug: Show raw payload data
    ESP_LOGI(TAG, "Raw payload (first 64 bytes):");
    for (int i = 0; i < 64 && i < (int)length; i++) {
        if (i % 16 == 0)
            ESP_LOGI(TAG, "");
        ESP_LOGI(TAG, "%02X ", data[i]);
    }
    ESP_LOGI(TAG, "");

    // Validate we have enough data for the header + entries
    size_t expected_size = sizeof(BrowseRespHeader) + (n_entries * sizeof(FileEntryWire));
    if (length < expected_size) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: got %d bytes, expected %d",
                 (int)length,
                 (int)expected_size);
        *count = 0;
        return false;
    }

    // Parse file entries
    uint32_t parsed_count = 0;
    const FileEntryWire* wire_entries = (const FileEntryWire*)(data + sizeof(BrowseRespHeader));

    ESP_LOGI(TAG, "Starting file entry parsing: n_entries=%u, max_count=%u", n_entries, *count);

    for (uint8_t i = 0; i < n_entries && parsed_count < *count; i++) {
        const FileEntryWire* wire = &wire_entries[i];

        ESP_LOGI(TAG,
                 "Parsing entry %d: is_dir=%d, size=%lu, name='%.50s'",
                 i,
                 wire->is_dir,
                 (unsigned long)wire->size_bytes,
                 wire->name);

        // Copy to our file entry structure
        wavex_file_entry_t* entry = &entries[parsed_count++];
        entry->is_directory = wire->is_dir != 0;
        entry->size_bytes = wire->size_bytes;
        strncpy(entry->name, wire->name, sizeof(entry->name) - 1);
        entry->name[sizeof(entry->name) - 1] = '\0';

        // Create full path - for now just use the name, full path will be constructed when needed
        strncpy(entry->path, entry->name, sizeof(entry->path) - 1);
        entry->path[sizeof(entry->path) - 1] = '\0';

        ESP_LOGI(TAG,
                 "Parsed entry %d: '%s' (%s) - %lu bytes",
                 i,
                 entry->name,
                 entry->is_directory ? "DIR" : "FILE",
                 (unsigned long)entry->size_bytes);
    }

    *count = parsed_count;
    return true;
}

// Parse browse response with pagination information using payload format
static bool parse_browse_response_with_pagination(const uint8_t* data,
                                                  size_t length,
                                                  wavex_file_entry_t* entries,
                                                  uint32_t* count,
                                                  uint32_t* total_files,
                                                  uint8_t* current_page_entries,
                                                  const char* current_path) {
    if (!data || length < sizeof(BrowseRespHeader)) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: %d bytes (need at least %d)",
                 (int)length,
                 (int)sizeof(BrowseRespHeader));
        *count = 0;
        *total_files = 0;
        *current_page_entries = 0;
        return false;
    }

    ESP_LOGI(TAG, "Parsing browse response payload: %d bytes", (int)length);

    // Parse payload directly: BrowseRespHeader + FileEntryWire entries
    const BrowseRespHeader* browse_header = (const BrowseRespHeader*)data;
    *total_files = browse_header->total_count;
    *current_page_entries = browse_header->n;

    ESP_LOGI(TAG,
             "Browse response: total_count=%lu, n_entries=%u",
             (unsigned long)*total_files,
             *current_page_entries);

    // Validate we have enough data for the header + entries
    size_t expected_size =
        sizeof(BrowseRespHeader) + (*current_page_entries * sizeof(FileEntryWire));
    if (length < expected_size) {
        ESP_LOGE(TAG,
                 "Browse response payload too short: got %d bytes, expected %d",
                 (int)length,
                 (int)expected_size);
        *count = 0;
        *total_files = 0;
        *current_page_entries = 0;
        return false;
    }

    // Parse file entries
    uint32_t parsed_count = 0;
    const FileEntryWire* wire_entries = (const FileEntryWire*)(data + sizeof(BrowseRespHeader));

