pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    ESP_LOGI(TAG,
             "Starting file entry parsing: n_entries=%u, max_count=%u",
             *current_page_entries,
             *count);

    for (uint8_t i = 0; i < *current_page_entries && parsed_count < *count; i++) {
        const FileEntryWire* wire_entry = &wire_entries[i];
        wavex_file_entry_t* entry = &entries[parsed_count];

        entry->is_directory = wire_entry->is_dir != 0;
        entry->size_bytes = wire_entry->size_bytes;

        // Copy WAV metadata
        entry->sample_rate = wire_entry->sample_rate;
        entry->channels = wire_entry->channels;
        entry->bits_per_sample = wire_entry->bits_per_sample;
        entry->duration_ms = wire_entry->duration_ms;

        // Copy name with null termination
        strncpy(entry->name, wire_entry->name, sizeof(entry->name) - 1);
        entry->name[sizeof(entry->name) - 1] = '\0';

        // Strip leading slash if present (Daisy sometimes includes it)
        if (entry->name[0] == '/') {
            memmove(entry->name, entry->name + 1, strlen(entry->name));
        }

        ESP_LOGD(TAG,
                 "Entry %d: Raw name from Daisy: '%s', after slash strip: '%s'",
                 i,
                 wire_entry->name,
                 entry->name);

        // Build full path with bounds checking
        const char* path_base = current_path ? current_path : "/";

        ESP_LOGD(TAG, "Entry %d: current_path='%s', entry->name='%s'", i, path_base, entry->name);

        // Ensure we don't have double slashes - remove trailing slash from current_path if present
        const char* base_path = path_base;
        if (strlen(path_base) > 1 && path_base[strlen(path_base) - 1] == '/') {
            // Create a temporary string without trailing slash
            static char temp_path[96];
            strncpy(temp_path, path_base, sizeof(temp_path) - 1);
            temp_path[sizeof(temp_path) - 1] = '\0';
            temp_path[strlen(temp_path) - 1] = '\0';  // Remove trailing slash
            base_path = temp_path;
        }

        // Special case: if base_path is "/" and entry->name starts with "/", avoid double slash
        int path_len;
        if (strcmp(base_path, "/") == 0 && entry->name[0] == '/') {
            path_len = snprintf(entry->path, sizeof(entry->path), "%s", entry->name);
            ESP_LOGD(TAG,
                     "Path construction (root case): base='%s', name='%s' -> path='%s'",
                     base_path,
                     entry->name,
                     entry->path);
        } else {
            path_len = snprintf(entry->path, sizeof(entry->path), "%s/%s", base_path, entry->name);
            ESP_LOGD(TAG,
                     "Path construction (normal case): base='%s', name='%s' -> path='%s'",
                     base_path,
                     entry->name,
                     entry->path);
        }
        if (path_len >= (int)sizeof(entry->path)) {
            // Path was truncated, ensure null termination
            entry->path[sizeof(entry->path) - 1] = '\0';
            ESP_LOGW(TAG, "Path truncated for entry: %s", entry->name);
        }

        parsed_count++;

        ESP_LOGI(TAG,
                 "Parsed entry %d: '%s' (%s) - %lu bytes",
                 i,
                 entry->name,
                 entry->is_directory ? "DIR" : "FILE",
                 (unsigned long)entry->size_bytes);
    }

    *count = parsed_count;
    return true;
}

// Send browse request to Daisy via comm interface
static bool send_browse_request(WaveX::Comm::ICommInterface* comm_interface,
                                const char* path,
                                uint8_t start_index) {
    if (!comm_interface) {
        ESP_LOGE(TAG, "No comm interface available for browse request");
        return false;
    }

    esp_err_t result = comm_interface->sendBrowseRequest(path, start_index);
    if (result != ESP_OK) {
        ESP_LOGE(TAG, "Failed to send browse request: %d", result);
        return false;
    }
    ESP_LOGI(
        TAG,
        "=== INTERFACE MESSAGE: Successfully sent browse request for path: %s, start_index: %d ===",
        path,
        start_index);
    return true;
}

// Browse response callback function
static void browse_resp_callback(const uint8_t* data, size_t length, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser || !data || length == 0) {
        ESP_LOGE(TAG, "Invalid browse response callback parameters");
        return;
    }

    ESP_LOGI(TAG, "Received browse response: %d bytes", (int)length);

    // Parse the browse response to get total count and current page entries
    // Allocate on heap instead of stack to prevent stack overflow in uart_link task
    // Each entry is ~152 bytes, so 20 entries = ~3040 bytes - too large for task stack
    wavex_file_entry_t* temp_entries = (wavex_file_entry_t*)malloc(20 * sizeof(wavex_file_entry_t));
    if (!temp_entries) {
        ESP_LOGE(TAG, "Failed to allocate memory for browse response parsing");
        browser->pagination_in_progress = false;
        return;
    }

    uint32_t temp_count = 20;
    uint32_t total_files = 0;
    uint8_t current_page_entries = 0;

    bool parse_success = parse_browse_response_with_pagination(data,
                                                               length,
                                                               temp_entries,
                                                               &temp_count,
                                                               &total_files,
                                                               &current_page_entries,
                                                               browser->current_path);

    if (!parse_success) {
        free(temp_entries);
        ESP_LOGE(TAG, "Failed to parse browse response");
        browser->pagination_in_progress = false;
        // Mark error state for deferred UI update (this callback runs from UART task, not LVGL
        // context)
        browser->entry_count = 0;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return;
    }

    // An empty listing is authoritative, and it can arrive UNSOLICITED: the
    // Daisy sends one when the card is ejected or becomes unreadable. The
    // accumulate path below cannot express it - loaded_entries is only reset
    // by refresh_file_list(), so an unsolicited response would re-adopt the
    // stale count and leave the old files on screen, and if current_page were
    // non-zero it would not even mark a UI update. Handle it directly.
    if (total_files == 0 && current_page_entries == 0) {
        free(temp_entries);
        ESP_LOGI(TAG, "Empty browse response - clearing file list");
        browser->total_files = 0;
        browser->loaded_entries = 0;
        browser->entry_count = 0;
        browser->current_page = 0;
        browser->first_visible_index = 0;
        browser->selected_index = 0;
        browser->pagination_in_progress = false;
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();
        return;
    }

