pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
    // Update browser state
    if (browser->current_page == 0) {
        // First page - initialize total count
        browser->total_files = total_files;
        ESP_LOGI(TAG, "Total files in directory: %d", total_files);
    }

    // Add current page entries to the browser's entry array
    // Sort ".." entries to the top if present (only on first page, and only if not at root)
    uint32_t start_index = browser->loaded_entries;
    uint32_t parent_dir_index = 0xFFFFFFFF;  // Track where ".." is found (using max value)

    // First pass: find ".." entry position if on first page and not at root
    if (browser->current_page == 0 && strcmp(browser->current_path, "/") != 0) {
        for (uint32_t i = 0; i < current_page_entries; i++) {
            if (strcmp(temp_entries[i].name, "..") == 0) {
                parent_dir_index = i;
                break;
            }
        }
    }

    // Second pass: add entries, putting ".." first if found on first page
    uint32_t write_index = start_index;

    // If ".." was found on first page and we're not at root, put it first
    if (parent_dir_index != 0xFFFFFFFF && browser->current_page == 0 &&
        strcmp(browser->current_path, "/") != 0 && write_index < browser->config.max_entries) {
        browser->entries[write_index] = temp_entries[parent_dir_index];
        browser->loaded_entries++;
        write_index++;
    }

    // Add all other entries (skip ".." if already added at the top)
    for (uint32_t i = 0; i < current_page_entries && write_index < browser->config.max_entries;
         i++) {
        if (parent_dir_index != 0xFFFFFFFF && i == parent_dir_index) {
            continue;  // Skip ".." if already added at the top
        }
        browser->entries[write_index] = temp_entries[i];
        browser->loaded_entries++;
        write_index++;
    }

    ESP_LOGI(TAG,
             "Loaded page %d: %d entries, total loaded: %d/%d",
             browser->current_page,
             current_page_entries,
             browser->loaded_entries,
             browser->total_files);

    // Free the temporary array now that we've copied the data
    free(temp_entries);

    // Check if we need to load more pages
    bool has_more_pages = (browser->loaded_entries < browser->total_files) &&
                          (browser->loaded_entries < browser->config.max_entries);

    // Update UI immediately after first page loads for better user experience
    if (browser->current_page == 0) {
        // First page loaded - mark UI update as pending
        browser->entry_count = browser->loaded_entries;

        // Reset scroll position for new directory
        browser->first_visible_index = 0;

        // Ensure selected_index is within bounds (default to first entry, or ".." if present)
        if (browser->selected_index >= browser->entry_count) {
            browser->selected_index = 0;
        }

        ESP_LOGI(TAG, "First page loaded: marking %d entries for UI update", browser->entry_count);

        // Set flag for UI task to process (thread-safe deferred update)
        browser_set_ui_update(browser);
        wavex_ui_mark_content_changed();

        // DEBUG: Direct refresh test - bypass normal update mechanism
        ESP_LOGI(TAG, "DEBUG: Adding direct refresh via lv_async_call");
        lv_async_call(
            [](void* data) {
                wavex_file_browser_t* b = (wavex_file_browser_t*)data;
                if (!b || !b->list) {
                ESP_LOGE(TAG, "DIRECT REFRESH: invalid browser or list");
                    return;
                }

                ESP_LOGI(TAG,
                         "DIRECT REFRESH: list valid=%d, entry_count=%d",
                         lv_obj_is_valid(b->list) ? 1 : 0,
                         b->entry_count);

                if (!lv_obj_is_valid(b->list)) {
                ESP_LOGE(TAG, "DIRECT REFRESH: list object is invalid!");
                    return;
                }

                // Clear existing items
                lv_obj_clean(b->list);

                // Update path label
                if (b->path_label && lv_obj_is_valid(b->path_label)) {
                    lv_label_set_text(b->path_label, b->current_path);
                }

                if (b->entry_count > 0 && b->entries) {
                    // Calculate which entries to display (scrolling viewport)
                    uint32_t start_index = b->first_visible_index;
                    uint32_t end_index = start_index + b->visible_count;
                    if (end_index > b->entry_count) {
                        end_index = b->entry_count;
                    }

                ESP_LOGI(TAG,
                             "DIRECT REFRESH: adding %d items (start=%d, end=%d)",
                             end_index - start_index,
                             start_index,
                             end_index);

                    // Create list items for visible entries
                    for (uint32_t i = start_index; i < end_index; i++) {
                        // Safety check for entry access
                        if (!b->entries[i].name[0]) {
                ESP_LOGW(TAG, "DIRECT REFRESH: Skipping empty entry at index %d", i);
                            continue;
                        }

                        lv_obj_t* btn = lv_list_add_btn(b->list, NULL, b->entries[i].name);
                        if (!btn) {
                ESP_LOGE(
                                TAG, "DIRECT REFRESH: Failed to create button for entry %d", i);
                            continue;
                        }

                        ui_theme_apply_button_style(btn, true);
                        fb_style_row(btn, &b->entries[i], i == b->selected_index);

                        // Add directory indicator
                        if (b->entries[i].is_directory) {
                            lv_obj_t* label = lv_obj_get_child(btn, 0);
                            if (label) {
                                char dir_text[64];
                                snprintf(
                                    dir_text, sizeof(dir_text), "[DIR] %s", b->entries[i].name);
                                lv_label_set_text(label, dir_text);
                            }
                        }

                        // Store entry index for selection
                        lv_obj_set_user_data(btn, (void*)(uintptr_t)i);
                    }

                ESP_LOGI(TAG, "DIRECT REFRESH: successfully added items to list");
                } else {
                ESP_LOGI(TAG, "DIRECT REFRESH: no entries to display");
                    // Show "No files found..." message
                    lv_obj_t* btn = lv_list_add_btn(b->list, NULL, "No files found...");
                    ui_theme_apply_button_style(btn, false);
                    lv_obj_set_style_text_color(btn, UI_COLOR_TEXT, LV_PART_MAIN);
                    lv_obj_set_style_text_font(btn, UI_FONT_TITLE, LV_PART_MAIN);
                }

