pmorgantech/WaveX/firmware/esp32/components/ui/components/file_browser.cpp
// Helper function to update visual selection highlighting
// NOTE: Must be called with LVGL lock already held
static void update_visual_selection(wavex_file_browser_t* browser) {
    if (!browser || !browser->list)
        return;

    // LVGL lock must be held by caller
    // Get all buttons in the list (these are only the visible ones)
    uint32_t child_count = lv_obj_get_child_cnt(browser->list);

    // Ensure selected_index is within bounds of all entries
    if (browser->selected_index >= browser->entry_count) {
        browser->selected_index = 0;  // Reset to first item if out of bounds
    }

    // Highlight the selected entry if it's visible
    for (uint32_t i = 0; i < child_count; i++) {
        lv_obj_t* btn = lv_obj_get_child(browser->list, i);
        if (btn) {
            // Get the actual entry index from user data
            uint32_t entry_index = (uint32_t)(uintptr_t)lv_obj_get_user_data(btn);

            const wavex_file_entry_t* entry =
                (entry_index < browser->entry_count) ? &browser->entries[entry_index] : nullptr;
            fb_style_row(btn, entry, entry_index == browser->selected_index);
        }
    }
    // Mark content as changed to trigger refresh (lock held by caller)
    wavex_ui_mark_content_changed();
}

// Storage appeared or vanished. Runs on the UART task, so it must not touch
// LVGL - refresh_file_list() only sends a browse request and sets the deferred
// UI-update flag, which is safe from here.
static void storage_status_callback(bool mounted, void* user_data) {
    wavex_file_browser_t* browser = (wavex_file_browser_t*)user_data;
    if (!browser) {
        return;
    }
    if (!mounted) {
        // The empty browse response that accompanies a loss already clears the
        // list; nothing to do but stop any pagination still in flight.
        browser->pagination_in_progress = false;
        ESP_LOGI(TAG, "Storage lost - browser idle");
        return;
    }
    ESP_LOGI(TAG, "Storage available - re-listing '%s'", browser->current_path);
    refresh_file_list(browser);
}
